KonstantinKolesnik/AquaExpert/Source/DTC/- Library/DTC/hardware/DTC/avr/boards.txt

DTCMicro.name=DTC Micro

DTCMicro.upload.tool=arduino:avrdude
DTCMicro.upload.protocol=arduino
DTCMicro.upload.maximum_size=30720
DTCMicro.upload.maximum_data_size=2048
DTCMicro.upload.speed=57600

DTCMicro.bootloader.tool=arduino:avrdude
DTCMicro.bootloader.unlock_bits=0x3F
DTCMicro.bootloader.lock_bits=0x0F
DTCMicro.bootloader.low_fuses=0xE2
DTCMicro.bootloader.high_fuses=0xD2
DTCMicro.bootloader.extended_fuses=0xFE
DTCMicro.bootloader.file=DualOptiboot/optiboot_atmega328p-pro8.hex

DTCMicro.build.board=AVR_MICRO8
DTCMicro.build.core=arduino:arduino
DTCMicro.build.variant=micro
DTCMicro.build.mcu=atmega328p
DTCMicro.build.f_cpu=8000000L
